Tekla.Structures.Dialog.ProfileConversion
The ProfileConversion class provides functionalities to convert profile strings from/to current units (set in
"Units and decimals, Catalog, Profiles, Section Dimension" options).
The next example assumes that the option "Units and decimals, Catalog, Profiles, Section Dimension"
is set to "in".
using Tekla.Structures.Dialog;
class Example
{
public Example()
{
string Profile = "PL10*10"; // Or "PL10\"*10\""
string ConvertedProfile = string.Empty;
ProfileConversion.ConvertFromCurrentUnits(Profile, ref ConvertedProfile);
// ConvertedProfile will contain "PL254*254"
Profile = "PL508*25.4";
ProfileConversion.ConvertToCurrentUnits(Profile, ref ConvertedProfile);
// The converted profile will contain "PL20\"*1\""
}
}

Tekla.Structures.Dialog.ProfileConversion.ConvertFromCurrentUnits(System.String,System.String@)
Converts a profile string from current units to internal units (set in
Units and decimals options).
Profile: The profile string to convert.
ConvertedProfile: The converted profile string.
Returns: True if successfully converted the string.

Tekla.Structures.Dialog.ProfileConversion.ConvertToCurrentUnits(System.String,System.String@)
Converts a profile string from internal units to current units (set in
Units and decimals options).
Profile: The profile string to convert.
ConvertedProfile: The converted profile string.
Returns: True if successfully converted the string.